[{"model": "blog.comment", "pk": 2, "fields": {"creator": 1, "content": "I like myself!", "content_type": 4, "object_id": 1, "created_at": "2022-08-02T03:24:04.826Z", "modified_at": "2022-08-02T03:24:04.842Z"}}, {"model": "blog.comment", "pk": 3, "fields": {"creator": 1, "content": "Amazing game with spectacular graphs! Enjoyable for any football fan or sport car fan!", "content_type": 7, "object_id": 1, "created_at": "2022-08-02T04:53:25.028Z", "modified_at": "2022-08-02T04:53:25.029Z"}}, {"model": "blog.comment", "pk": 4, "fields": {"creator": 1, "content": "Best game of all time!", "content_type": 7, "object_id": 6, "created_at": "2022-08-08T15:35:40.760Z", "modified_at": "2022-08-08T15:35:40.760Z"}}, {"model": "blog.tag", "pk": 1, "fields": {"value": "cars"}}, {"model": "blog.tag", "pk": 2, "fields": {"value": "django"}}, {"model": "blog.tag", "pk": 3, "fields": {"value": "soccer"}}, {"model": "blog.tag", "pk": 4, "fields": {"value": "game"}}, {"model": "blog.tag", "pk": 5, "fields": {"value": "fortnite"}}, {"model": "blog.tag", "pk": 6, "fields": {"value": "rockstar"}}, {"model": "blog.tag", "pk": 7, "fields": {"value": "batman"}}, {"model": "blog.tag", "pk": 8, "fields": {"value": "zombies"}}, {"model": "blog.post", "pk": 1, "fields": {"author": 1, "created_at": "2022-07-19T22:10:06.356Z", "modified_at": "2022-08-01T18:48:19.096Z", "published_at": "2022-07-19T22:01:56Z", "title": "Rocket League", "slug": "rocket-league", "summary": "Rocket League's gameplay is largely the same as that of its predecessor, Supersonic Acrobatic Rocket-Powered Battle-Cars. Players control a rocket-powered car and use it to hit a ball that is much larger than the cars towards the other team's goal area to score goals, in a way that resembles indoor soccer, with elements reminiscent of a demolition derby.[1][2] Players' cars have the ability to jump to hit the ball while in mid-air. The players can also pick up a speed boost by passing their cars", "content": "compete in the high-octane hybrid of arcade-style soccer and vehicular mayhem! customize your car, hit the field, and compete in one of the most critically acclaimed sports games of all time! Download and take your shot!\r\nHit the field by yourself or with friends in 1v1, 2v2, and 3v3 Online Modes, or enjoy Extra Modes like Rumble, Snow Day, or Hoops. Unlock items in Rocket Pass, climb the Competitive Ranks, compete in Competitive Tournaments, complete Challenges, enjoy cross-platform progression and more! The field is waiting. Take your shot!", "tags": [1, 2, 3]}}, {"model": "blog.post", "pk": 2, "fields": {"author": 1, "created_at": "2022-07-25T20:02:24.366Z", "modified_at": "2022-07-25T20:02:24.366Z", "published_at": "2022-07-25T20:00:50Z", "title": "Fall Guys: Ultimate Knockout", "slug": "fall-guys-ultimate-knockout", "summary": "Up to 60 players compete in matches with battle royale-style gameplay. Players, represented as jellybean-like figures, move around a three-dimensional playing field, with additional moves such as jumping, grabbing/climbing, or diving to assist gameplay. The aim is to qualify for subsequent rounds by successfully completing each of the randomly selected mini-games. Certain mini-games involve running towards a finish line at the end of the map, playing tag with other player", "content": "he conception of what became Fall Guys began when Mediatonic was discussing another project in January 2018. Lead designer Joe Walsh said that it reminded him of game shows such as Takeshi's Castle and Total Wipeout. He drew from that inspiration to create a pitch document for what would become Fall Guys. Originally titled Fools' Gauntlet, Walsh's pitch featured 100 players competing in a battle royale composed of physical challenges. Creative director Jeff Tanton, while initially sceptical that creating another battle royale game would be successful, was quickly convinced of the game's potential, and forwarded Walsh's pitch to Mediatonic's founders.", "tags": [2, 4]}}, {"model": "blog.post", "pk": 3, "fields": {"author": 1, "created_at": "2022-07-25T20:04:12.396Z", "modified_at": "2022-07-25T20:04:12.396Z", "published_at": "2022-07-25T20:02:31Z", "title": "Fortnite", "slug": "fortnite", "summary": "Fortnite is an online video game developed by Epic Games and released in 2017. It is available in three distinct game mode versions that otherwise share the same general gameplay and game engine: Fortnite Battle Royale, a free-to-play battle royale game in which up to 100 players fight to be the last person standing; Fortnite: Save the World, a cooperative hybrid tower defense-shooter and survival game in which up to four players fight off zombie-like creatures and defend objects with traps and", "content": "Fortnite is distributed as three different game modes, using the same engine; each has similar graphics, art assets, and game mechanics.\r\n\r\nFortnite: Save the World is a player-versus-environment cooperative game, with four players collaborating towards a common objective on various missions. The game is set after a fluke storm appears across Earth, causing 98% of the population to disappear, and the survivors to be attacked by zombie-like \"husks\". The players take the role of commanders of home base shelters, collecting resources, saving survivors, and defending equipment that helps to either collect data on the storm or to push back the storm. From missions, players are awarded a number of in-game items, which include hero characters, weapon and trap schematics, and survivors, all of which can be leveled up through gained experience to improve their attributes.\r\nFortnite Battle Royale is a player-versus-player game for up to 100 players, allowing one to play alone, in a duo, or in a squad (usually consisting of three or four players). Weaponless players airdrop from a \"Battle Bus\" that crosses the game's map. When they land, they must scavenge for weapons, items, resources, and even vehicles while trying to stay alive and to attack and eliminate other players. Over the course of a round, the safe area of the map shrinks down in size due to an incoming toxic storm; players outside that threshold take damage and can be eliminated if they fail to quickly evacuate. This forces remaining players into tighter spaces and encourages player encounters. The last player, duo, or squad remaining is the winner.\r\nFortnite Creative is a sandbox game mode, in which players are given complete freedom to spawn any item from the Battle Royale gamemode on a personal island, and can create games such as battle arenas, race courses, platforming challenges, and more.\r\nPlayers can use their pickaxe to knock down existing structures on the map to collect basic resources that are wood, brick, and metal. Subsequently, in all modes, the player can use these materials to build fortifications, such as walls, floors, and stairs. Such fortification pieces can be edited to add things like windows or doors. The materials used have different durability properties and can be updated to stronger variants using more materials of the same type. Within Save the World this enables players to create defensive fortifications around an objective or trap-filled tunnels to lure husks through. In Battle Royale, this provides the means to quickly traverse the map, protect oneself from enemy fire, or to delay an advancing foe. Players are encouraged to be very inventive in designing their fortifications in Creative.", "tags": [2, 4, 5]}}, {"model": "blog.post", "pk": 4, "fields": {"author": 1, "created_at": "2022-08-01T18:51:22.756Z", "modified_at": "2022-08-01T18:51:22.756Z", "published_at": "2022-08-01T18:48:30Z", "title": "Red Dead Redemption II", "slug": "red-dead-redemption-ii", "summary": "Red Dead Redemption 2 turns three years old today, and it remains the most impressive game I’ve ever played. The best? Well, that’s relative. There are several games from my childhood I’m more fond of, but can anyone really compare Pokemon Blue to Red Dead Redemption 2? Most of the things we discuss in games are similarly relative, similarly subjective, similarly rooted in opinion and feeling and intangible vibes. When I say Red Dead Redemption 2 is the most impressive game I’ve ever played, I d", "content": "Even the word ‘impressive’ is subjective - what impresses you might not impress me. The amount of times I’ve tried to show my partner something impressive from the worlds of sports, gaming, or the Terminally Online parts of the internet just to have her smile and nod attests to that. But when we look at what games are capable of, how they tell their stories, how they build their worlds, how they construct a tactile reality in front of us, it’s hard not to be impressed by Red Dead Redemption 2.", "tags": [2, 4, 6]}}, {"model": "blog.post", "pk": 5, "fields": {"author": 1, "created_at": "2022-08-08T02:58:36.801Z", "modified_at": "2022-08-08T02:58:36.801Z", "published_at": "2022-08-08T02:57:53Z", "title": "Batman Arkham Knight", "slug": "batman-arkham-knight", "summary": "Nine months after the Joker's death, crime rates in Gotham City have dramatically declined, but Batman anticipates a new threat and maintains a vigil over the city. Before his death, the Joker sent his mutated blood to Gotham's hospitals, and several patients were infected. While most were cured, the patients who were not treated are starting to look and act like the Joker. Batman researches a cure for the mutations, and orders Robin to watch over the infected.", "content": "On Halloween night, Scarecrow unleashes his newest strain of Fear Gas in a diner, and threatens to release it throughout Gotham. Six million civilians are evacuated, but the city's criminals and supervillains stay behind, leaving Commissioner James Gordon and the Gotham City Police Department outnumbered. Batman investigates Scarecrow's presence, and searches for him in a rooftop safehouse, but instead finds and saves Poison Ivy, who was being held captive by Scarecrow's henchmen. In a makeshift Batcave in Gotham's Clock Tower, Barbara Gordon is collecting information on Scarecrow's new toxin, and traces its production to Ace Chemicals. Batman goes to investigate, but is confronted by the mysterious \"Arkham Knight\" and his militia, which has a massive army of unmaned tanks. Batman fights his way through the militia, learning from workers that Scarecrow is planning to produce a chemical explosion so large that it will cover the entire eastern seaboard in fear toxin. Batman reaches Scarecrow, who reveals to him that Barbara has been abducted by the Arkham Knight before escaping. While reducing the blast radius, Batman is exposed to the fear toxin, which reacts with his own mutated blood to cause hallucinations of the Joker. Escaping from the exploding Ace Chemicals, Batman is forced to tell Gordon about his daughter's involvement in his crime-fighting, and the outraged Gordon swears that he will find Barbara without Batman's help.", "tags": [2, 4, 7]}}, {"model": "blog.post", "pk": 6, "fields": {"author": 1, "created_at": "2022-08-08T15:34:38.339Z", "modified_at": "2022-08-08T15:34:38.339Z", "published_at": "2022-08-08T15:33:49Z", "title": "The Last Of Us", "slug": "the-last-of-us", "summary": "In 2013, Joel (voiced and motion captured by Troy Baker) is a single father living near Austin, Texas, with his twelve-year-old daughter Sarah (Hana Hayes). One night, an outbreak of a mutant Cordyceps fungus ravages the United States, transforming its human hosts into cannibalistic monsters. As Joel, his brother Tommy (Jeffrey Pierce), and Sarah flee the chaos, Sarah is shot by a soldier and dies in Joel's arms.\r\n\r\nTwenty years later, most of civilization has been destroyed by the infection.", "content": "Joel decides to find Tommy, a former Firefly, in the hope that he can locate the remaining Fireflies. With the help of Bill (W. Earl Brown), a smuggler who owes Joel a favor, they acquire a working vehicle. Driving into Pittsburgh, they are ambushed by bandits and their car is wrecked. They ally with two brothers, Henry (Brandon Scott) and Sam (Nadji Jeter); after they escape the city, Sam is bitten by an infected but hides it from the group. As his infection takes hold, Sam attacks Ellie, but Henry shoots him and then commits suicide out of grief.\r\n\r\nIn the fall, Joel and Ellie finally find Tommy in Wyoming, where he has assembled a fortified settlement near a hydroelectric dam with his wife Maria (Ashley Scott). Joel contemplates leaving Ellie with Tommy, but after she confronts him about Sarah, he decides to stay with her. Tommy directs them to a Fireflies enclave at the University of Eastern Colorado. There, they find the university abandoned, but learn that the Fireflies have moved to a hospital in Salt Lake City. As they leave, they are attacked by bandits and Joel is severely wounded.\r\n\r\nDuring the winter, Ellie and Joel shelter in the mountains. Joel is on the brink of death and relies on Ellie to care for him. Hunting for food, Ellie encounters David (Nolan North) and James (Reuben Langdon), scavengers willing to trade medicine for food; David reveals that the university bandits Ellie and Joel killed were part of his group. Ellie manages to lead David's group away from Joel, but is eventually captured; David intends to recruit her into his cannibal group. She escapes after killing James but David corners her in a burning restaurant. Meanwhile, Joel recovers from his wounds and sets out to find Ellie. He reaches Ellie as she kills David; Joel consoles her before they flee.\r\n\r\nIn the spring, Joel and Ellie arrive in Salt Lake City and are captured by a Firefly patrol. In the hospital, Marlene tells Joel that Ellie is being prepared for surgery: in hope of producing a vaccine for the infection, the Fireflies must remove Ellie's infected brain, which will kill her. Joel battles his way to the operating room and carries the unconscious Ellie to the parking garage. There he confronts and kills Marlene to prevent the Fireflies from pursuing them. On the drive out of the city, Joel lies to Ellie about what happened, telling her that the Fireflies had found many other people who are immune, but were unable to create a cure and have stopped trying. The pair arrive on the outskirts of Tommy's settlement. Ellie expresses her survivor guilt and asks Joel to swear that his story is true; he does.", "tags": [2, 4, 8]}}, {"model": "blango_auth.User", "pk": 1, "fields": {"password": "pbkdf2_sha256$260000$fNp3JfLYJkqnNXt4LsF3ws$MHndmu+OYO33j+kHZmwG2lpCIt5aghZpRHQTr8ZTj5I=", "last_login": "2022-08-03T15:22:22.162Z", "is_superuser": true, "username": "raulmaya", "first_name": "", "last_name": "", "email": "raulmayas20@gmail.com", "is_staff": true, "is_active": true, "date_joined": "2022-07-19T18:44:40.031Z", "groups": [], "user_permissions": []}}]